Тест_ЗУП_31_КОРП/src/Catalogs/ЗванияГражданскогоВоинскогоУчета/ЗванияГражданскогоВоинскогоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗванияГражданскогоВоинскогоУчета</name>
  <attributes>
    <name>ОбщевойсковоеЗвание</name>
    <type>
      <types>EnumRef.КлассификаторВоинскихЗваний</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состав</name>
    <type>
      <types>CatalogRef.СоставыВоеннослужащих</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Enums/КлассификаторВоинскихЗваний/КлассификаторВоинскихЗваний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КлассификаторВоинскихЗваний</name>
  <enumValues>
    <name>Рядовой</name>
  </enumValues>
  <enumValues>
    <name>Матрос</name>
  </enumValues>
  <enumValues>
    <name>Ефрейтор</name>
  </enumValues>
  <enumValues>
    <name>СтаршийМатрос</name>
  </enumValues>
  <enumValues>
    <name>МладшийСержант</name>
  </enumValues>
  <enumValues>
    <name>Старшина2Статьи</name>
  </enumValues>
  <enumValues>
    <name>Сержант</name>
  </enumValues>
  <enumValues>
    <name>Старшина1Статьи</name>
  </enumValues>
  <enumValues>
    <name>СтаршийСержант</name>
  </enumValues>
  <enumValues>
    <name>ГлавныйСтаршина</name>
  </enumValues>
  <enumValues>
    <name>Старшина</name>
  </enumValues>
  <enumValues>
    <name>ГлавныйКорабельныйСтаршина</name>
  </enumValues>
  <enumValues>
    <name>Прапорщик</name>
  </enumValues>
  <enumValues>
    <name>Мичман</name>
  </enumValues>
  <enumValues>
    <name>СтаршийПрапорщик</name>
  </enumValues>
  <enumValues>
    <name>СтаршийМичман</name>
  </enumValues>
  <enumValues>
    <name>МладшийЛейтенант</name>
  </enumValues>
  <enumValues>
    <name>Лейтенант</name>
  </enumValues>
  <enumValues>
    <name>СтаршийЛейтенант</name>
  </enumValues>
  <enumValues>
    <name>Капитан</name>
  </enumValues>
  <enumValues>
    <name>КапитанЛейтенант</name>
  </enumValues>
  <enumValues>
    <name>Майор</name>
  </enumValues>
  <enumValues>
    <name>Капитан3Ранга</name>
  </enumValues>
  <enumValues>
    <name>Подполковник</name>
  </enumValues>
  <enumValues>
    <name>Капитан2Ранга</name>
  </enumValues>
  <enumValues>
    <name>Полковник</name>
  </enumValues>
  <enumValues>
    <name>Капитан1Ранга</name>
  </enumValues>
  <enumValues>
    <name>ГенералМайор</name>
  </enumValues>
  <enumValues>
    <name>КонтрАдмирал</name>
  </enumValues>
  <enumValues>
    <name>ГенералЛейтенант</name>
  </enumValues>
  <enumValues>
    <name>ВицеАдмирал</name>
  </enumValues>
  <enumValues>
    <name>ГенералПолковник</name>
  </enumValues>
  <enumValues>
    <name>Адмирал</name>
  </enumValues>
  <enumValues>
    <name>ГенералАрмии</name>
  </enumValues>
  <enumValues>
    <name>АдмиралФлота</name>
  </enumValues>
  <enumValues>
    <name>МаршалРоссийскойФедерации</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Catalogs/ЗванияГражданскогоВоинскогоУчета/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура выполняет первоначальное заполнение классификатора.
Процедура НачальноеЗаполнение() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлассификаторВоинскихЗваний.Ссылка КАК ОбщевойсковоеЗвание,
		|	ПРЕДСТАВЛЕНИЕ(КлассификаторВоинскихЗваний.Ссылка) КАК Наименование
		|ИЗ
		|	Перечисление.КлассификаторВоинскихЗваний КАК КлассификаторВоинскихЗваний
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗванияГражданскогоВоинскогоУчета КАК ЗванияГражданскогоВоинскогоУчета
		|		ПО КлассификаторВоинскихЗваний.Ссылка = ЗванияГражданскогоВоинскогоУчета.ОбщевойсковоеЗвание
		|ГДЕ
		|	ЗванияГражданскогоВоинскогоУчета.Ссылка ЕСТЬ NULL 
		|
		|УПОРЯДОЧИТЬ ПО
		|	КлассификаторВоинскихЗваний.Порядок";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СоответствиеЗванийИСоставов = СоответствиеВоинскихЗванийИСоставов();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СправочникОбъект = Справочники.ЗванияГражданскогоВоинскогоУчета.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(СправочникОбъект, Выборка);
			СправочникОбъект.Состав = СоответствиеЗванийИСоставов[Выборка.ОбщевойсковоеЗвание];
			СправочникОбъект.Записать();
			
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоответствиеВоинскихЗванийИСоставов()
	
	Солдаты 		= Справочники.СоставыВоеннослужащих.НайтиПоНаименованию("Солдаты, матросы, сержанты, старшины", Истина);
	Прапорщики 		= Справочники.СоставыВоеннослужащих.НайтиПоНаименованию("Прапорщики и мичманы", Истина);
	МладшиеОфицеры 	= Справочники.СоставыВоеннослужащих.НайтиПоНаименованию("Младшие офицеры", Истина);
	СтаршиеОфицеры 	= Справочники.СоставыВоеннослужащих.НайтиПоНаименованию("Старшие офицеры", Истина);
	ВысшиеОфицеры 	= Справочники.СоставыВоеннослужащих.НайтиПоНаименованию("Высшие офицеры", Истина);
	
	СоответствиеЗванийИСоставов = Новый Соответствие;
	
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Рядовой, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Матрос, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Ефрейтор, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.СтаршийМатрос, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.МладшийСержант, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Старшина2Статьи, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Сержант, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Старшина1Статьи, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.СтаршийСержант, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.ГлавныйСтаршина, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Старшина, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.ГлавныйКорабельныйСтаршина, Солдаты);
	
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Прапорщик, Прапорщики);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Мичман, Прапорщики);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.СтаршийПрапорщик, Прапорщики);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.СтаршийМичман, Прапорщики);
	
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.МладшийЛейтенант, МладшиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Лейтенант, МладшиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.СтаршийЛейтенант, МладшиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Капитан, МладшиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.КапитанЛейтенант, МладшиеОфицеры);
	
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Майор, СтаршиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Капитан3Ранга, СтаршиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Подполковник, СтаршиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Капитан2Ранга, СтаршиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Полковник, СтаршиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Капитан1Ранга, СтаршиеОфицеры);
	
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.ГенералМайор, ВысшиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.КонтрАдмирал, ВысшиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.ГенералЛейтенант, ВысшиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.ВицеАдмирал, ВысшиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.ГенералПолковник, ВысшиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Адмирал, ВысшиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.ГенералАрмии, ВысшиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.АдмиралФлота, ВысшиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.МаршалРоссийскойФедерации, ВысшиеОфицеры);
	
	Возврат СоответствиеЗванийИСоставов;
	
КонецФункции	

#КонецОбласти

#КонецЕсли
